
## Plan Result (terraform/cloudflare/b0xp.io/kubernetes-dashboard)

[CI link](https://github.com/boxp/arch/actions/runs/16387069589)


<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.kubernetes_dashboard_tunnel_token
  * cloudflare_access_application.kubernetes_dashboard
  * cloudflare_access_policy.kubernetes_dashboard_policy
  * cloudflare_record.kubernetes_dashboard
  * cloudflare_tunnel.kubernetes_dashboard_tunnel
  * cloudflare_tunnel_config.kubernetes_dashboard_tunnel
  * random_password.tunnel_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.kubernetes_dashboard_tunnel_token will be created
  + resource "aws_ssm_parameter" "kubernetes_dashboard_tunnel_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "for kubernetes-dashboard tunnel token"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "kubernetes-dashboard-tunnel-token"
      + region         = "ap-northeast-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # cloudflare_access_application.kubernetes_dashboard will be created
  + resource "cloudflare_access_application" "kubernetes_dashboard" {
      + account_id                   = (known after apply)
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + domain                       = "kubernetes-dashboard.b0xp.io"
      + domain_type                  = (known after apply)
      + enable_binding_cookie        = false
      + id                           = (known after apply)
      + name                         = "Access application for kubernetes-dashboard.b0xp.io"
      + options_preflight_bypass     = false
      + service_auth_401_redirect    = false
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + skip_interstitial            = false
      + type                         = "self_hosted"
      + zone_id                      = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_access_policy.kubernetes_dashboard_policy will be created
  + resource "cloudflare_access_policy" "kubernetes_dashboard_policy" {
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "policy for kubernetes-dashboard.b0xp.io"
      + precedence     = 1
      + zone_id        = "ec593206d0ef695c3aae3a4cb3173264"

      + include {
          + login_method = [
              + "b9248b7d-c1fa-48ab-8a43-ebffe03fabac",
            ]
        }
    }

  # cloudflare_record.kubernetes_dashboard will be created
  + resource "cloudflare_record" "kubernetes_dashboard" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "kubernetes-dashboard"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_tunnel.kubernetes_dashboard_tunnel will be created
  + resource "cloudflare_tunnel" "kubernetes_dashboard_tunnel" {
      + account_id   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "cloudflare kubernetes-dashboard tunnel"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

  # cloudflare_tunnel_config.kubernetes_dashboard_tunnel will be created
  + resource "cloudflare_tunnel_config" "kubernetes_dashboard_tunnel" {
      + account_id = "1984a4314b3e75f3bedce97c7a8e0c81"
      + id         = (known after apply)
      + tunnel_id  = (known after apply)

      + config {
          + ingress_rule {
              + hostname = (known after apply)
              + service  = "https://kubernetes-dashboard-lb.kube-dashboard:443"
            }
          + ingress_rule {
              + service = "http_status:404"
            }
        }
    }

  # random_password.tunnel_secret will be created
  + resource "random_password" "tunnel_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with cloudflare_access_application.kubernetes_dashboard,
  on access.tf line 2, in resource "cloudflare_access_application" "kubernetes_dashboard":
   2: resource "cloudflare_access_application" "kubernetes_dashboard" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 9 more similar warnings elsewhere)
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Deprecated Resource

  with cloudflare_access_application.kubernetes_dashboard,
  on access.tf line 2, in resource "cloudflare_access_application" "kubernetes_dashboard":
   2: resource "cloudflare_access_application" "kubernetes_dashboard" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 9 more similar warnings elsewhere)
```



## :warning: Errors

* add a label terraform/cloudflare/b0xp.io/kubernetes-dashboard/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/4321/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":4321,"Program":"tfcmt","SHA1":"d424623ffe82e5083ba73d3e45b7d24eed89da98","Target":"terraform/cloudflare/b0xp.io/kubernetes-dashboard","Vars":{},"WorkflowName":"pull_request_target"} -->